// Описание:
// Дан массив целых чисел, нужно найти его сумму.

// Ввод:
// [2, 3, 5, -1]

// Вывод:
// Число

// Пример:
// [1, 2, -3] => 0

// Тесты:
// getResult([1, 2, 3, 4, 5]) == 15
// getResult([-1, -2, -3, -4, -5]) == -15
// getResult([-2, -2, 0, 4]) == 0


a = [1, 2, 3, 4, 5]
b = [-1, -2, -3, -4, -5]
c = [-2, -2, 0, 4]
function sumArr(array) {
    sum = 0
    for (i = 0; i < a.length; i++) {
    sum = sum + array[i]
    }
    return sum
}


console.log(sumArr(a))


